# Must Knows in Pandas
- View Dataframe
- Rename Columns
- Drop Column
- Filtering
- Add Column
- Fill Nulls
- Aggregation
- Standard Transformations
- Keep it in the JVM
- Row Conditional Statements
- Python when Required
- merge/join dataframes
- Pivot table
- Summary Statistics
- histogram
- SQL

In [41]:
import pandas as pd

In [42]:
staff_df=pd.DataFrame([{'Name': 'Kelly', 'Role': 'Directory of HR'},
                        {'Name': 'sally', 'Role': 'course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df=staff_df.set_index('Name')
staff_df

                  Role
Name
Kelly  Directory of HR
sally   course liasion
James           Grader

### In Real life most people use following line to load data 
df = pd.read_csv('census.csv') \
df

### View dataframe

In [43]:
staff_df
df=staff_df

In [46]:
df.head(2)

                  Role
Name
Kelly  Directory of HR
sally   course liasion

In [47]:
df.columns

Index(['Role'], dtype='object')

In [48]:
df.dtypes

Role    object
dtype: object

### create new columns

In [49]:
df['copy_of_role']=df['Role']
df

                  Role     copy_of_role
Name
Kelly  Directory of HR  Directory of HR
sally   course liasion   course liasion
James           Grader           Grader

### rename columns

In [59]:
df.columns=['role1','role2']
df

                 role1            role2
Name
Kelly  Directory of HR  Directory of HR
sally   course liasion   course liasion
James           Grader           Grader

In [60]:
df.rename(columns={'role2':'new_role'})
df

                 role1            role2
Name
Kelly  Directory of HR  Directory of HR
sally   course liasion   course liasion
James           Grader           Grader

### why it does not work????

In [61]:
df.rename(columns={'role2':'new_role'}, inplace=True)
df

                 role1         new_role
Name
Kelly  Directory of HR  Directory of HR
sally   course liasion   course liasion
James           Grader           Grader

### drop columns

In [65]:
df.drop(['new_role'],axis=1, inplace=True)

                 role1
Name
Kelly  Directory of HR
sally   course liasion
James           Grader

### Filtering by rows and columns

In [81]:
# df[df.Name=='kelly']
df.loc[['Kelly', 'sally']]

                 role1  dummy
Name
Kelly  Directory of HR      1
sally   course liasion      2

### .loc and .iloc are looking for a tuple as inputs
so you will need to provide a list, which could be a string, or numbers

In [88]:
# df[df.Name=='kelly']
df.iloc[[0,2]]

                 role1  dummy
Name
Kelly  Directory of HR      1
James           Grader      3

### Add Columns

In [89]:
df['dummy']=[1,2,3]
df

                 role1  dummy
Name
Kelly  Directory of HR      1
sally   course liasion      2
James           Grader      3

### Filtering by values

In [124]:
df[(df.dummy<=2)|(df.index=='James')]

                 role1  dummy
Name
Kelly  Directory of HR      1
sally   course liasion      2
James           Grader      3

### Warning:pandas is picky, you have to use (cond1)|(cond2)&(cond3)!

### Logical Operators
in Pandas are &, | and ~, and parentheses (...) is important!

### FILL NULLS

In [125]:
df.fillna(0)

                 role1  dummy
Name
Kelly  Directory of HR      1
sally   course liasion      2
James           Grader      3

### Aggregation
let's create another dataframe

In [154]:
staff_df['dummy1']=[2,3,4]
df=staff_df

### simple way for aggregation

In [155]:
df.groupby(['role1']).agg(['min','max','count'])
# remember to use [] to call agg function

                dummy           dummy1
                  min max count    min max count
role1
Directory of HR     1   1     1      2   2     1
Grader              3   3     1      4   4     1
course liasion      2   2     1      3   3     1

In [161]:
df.agg?

                 role1  dummy  dummy1
Name
Kelly  Directory of HR      1       2
sally   course liasion      2       3
James           Grader      3       4

### Little complication

In [157]:
df.groupby(['role1']).agg({'dummy':['min','max'],'dummy1':['count']})
# df.agg({'A' : ['sum', 'min'], 'B' : ['min', 'max']})

                dummy     dummy1
                  min max  count
role1
Directory of HR     1   1      1
Grader              3   3      1
course liasion      2   2      1

### Row Condition statements

In [162]:
df['New']=df['dummy1'].apply(lambda x: 1 if x>2 else 2 if x<1 else 3)

In [163]:
df

                 role1  dummy  dummy1  New
Name
Kelly  Directory of HR      1       2    3
sally   course liasion      2       3    1
James           Grader      3       4    1

# SECTION2

### Concat, Join and Merge

In [166]:
student_df=pd.DataFrame([{'Name': 'James', 'school': 'buisness'},
                        {'Name': 'sally', 'school': 'law'},
                         {'Name': 'Mike', 'school': 'engineering'}])
student_df=student_df.set_index('Name')
student_df

            school
Name
James     buisness
sally          law
Mike   engineering

In [165]:
staff_df=pd.DataFrame([{'Name': 'Kelly', 'Role': 'Directory of HR'},
                        {'Name': 'sally', 'Role': 'course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df=staff_df.set_index('Name')
staff_df

                  Role
Name
Kelly  Directory of HR
sally   course liasion
James           Grader

### Concatenate dataframes, note axis and []

In [184]:
# df.join?
new_df=pd.concat([student_df, staff_df], axis=1)
new_df

            school             Role
Name
James     buisness           Grader
sally          law   course liasion
Mike   engineering              NaN
Kelly          NaN  Directory of HR

### Join tables (dataframess) using df1.join(df2)

In [186]:
staff_df.join(student_df, how='outer',sort='Name')
# df.join(other, lsuffix='_caller', rsuffix='_other')

                  Role       school
Name
James           Grader     buisness
Kelly  Directory of HR          NaN
Mike               NaN  engineering
sally   course liasion          law

In [188]:
staff_df.join(student_df, how='inner')
# df.join(other, lsuffix='_caller', rsuffix='_other')

                 Role    school
Name
sally  course liasion       law
James          Grader  buisness

In [189]:
staff_df.join(student_df, how='left')
# df.join(other, lsuffix='_caller', rsuffix='_other')

                  Role    school
Name
Kelly  Directory of HR       NaN
sally   course liasion       law
James           Grader  buisness

In [190]:
staff_df.join(student_df, how='right')
# df.join(other, lsuffix='_caller', rsuffix='_other')

                 Role       school
Name
James          Grader     buisness
sally  course liasion          law
Mike              NaN  engineering

### Merge tables (dataframess) using df1.merge(df2)
More flexible and versatile way of join tables

In [200]:
df.merge?
# df1.merge(df2, left_on='lkey', right_on='rkey')
# f.merge(
#     right,
#     how='inner',
#     on=None,
#     left_on=None,
#     right_on=None,
#     left_index=False,
#     right_index=False,
#     sort=False,
#     suffixes=('_x', '_y'),
#     copy=True,
#     indicator=False,
#     validate=None,
# ) -> 'DataFrame'

In [204]:
new_df=staff_df.merge(student_df, how='outer',left_index=True, right_index=True)
new_df

                  Role       school
Name
James           Grader     buisness
Kelly  Directory of HR          NaN
Mike               NaN  engineering
sally   course liasion          law

### such as left.merge(right, left_on='a', right_on='b')

### PIVOT and PIVOT Table in Pandas

~~~
pd.pivot_table(df, values='D' 
              index=['a','b'], 
               columns=['c'], 
               aggfimc=np.sum)
~~~

### Let's prepare a classic dataframe using sklearn package in python

In [243]:
from sklearn.datasets import load_iris
X, y = load_iris(return_X_y=True)
df1=pd.DataFrame(X)
df2=pd.DataFrame(y)

In [244]:
df1.columns=['sepal_length','sepal_width','petal_length','petal_width']
df2.columns=['species']
df=df1.join(df2)
df['species_name']=df.species.apply( lambda x : 'setosa' if x==0 else 'versicolor'if x==1 else 'virginica' )
df

,sepal_length,sepal_width,petal_length,petal_width,species,species_name
0,5.1,3.5,1.4,0.2,0,setosa
1,4.9,3.0,1.4,0.2,0,setosa
2,4.7,3.2,1.3,0.2,0,setosa
3,4.6,3.1,1.5,0.2,0,setosa
4,5.0,3.6,1.4,0.2,0,setosa
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,2,virginica
146,6.3,2.5,5.0,1.9,2,virginica
147,6.5,3.0,5.2,2.0,2,virginica
148,6.2,3.4,5.4,2.3,2,virginica
149,5.9,3.0,5.1,1.8,2,virginica

In [251]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                            'two'],
                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'baz': [1, 2, 3, 4, 5, 6],
                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [253]:
df.pivot(index='bar',columns='foo', values='zoo')

foo one two
bar
A     x   q
B     y   w
C     z   t

In [254]:
df = pd.DataFrame({
        "lev1": [1, 1, 1, 2, 2, 2],
        "lev2": [1, 1, 2, 1, 1, 2],
        "lev3": [1, 2, 1, 2, 1, 2],
        "lev4": [1, 2, 3, 4, 5, 6],
        "values": [0, 1, 2, 3, 4, 5]})
df

   lev1  lev2  lev3  lev4  values
0     1     1     1     1       0
1     1     1     2     2       1
2     1     2     1     3       2
3     2     1     2     4       3
4     2     1     1     5       4
5     2     2     2     6       5

In [271]:
df.pivot(index="lev1", columns=["lev2", "lev3"],values="values")
df.pivot(index=["lev2", "lev3"], columns="lev1", values="lev2")
# df.pivot(index="lev2", columns="lev1", values="lev3")

lev1         1    2
lev2 lev3
1    1     1.0  1.0
     2     1.0  1.0
2    1     2.0  NaN
     2     NaN  2.0

https://www.youtube.com/watch?v=xPPs59pn6qU
aggfunc numpy function
https://github.com/codebasics/py/blob/master/pandas/10_pivot/pandas_pivot.ipynb

### Pivot Table

In [275]:
new_df=pd.pivot_table(df, 
                     index="lev2",
                      columns="lev1",
                     ) #take average of the lev3, lev4
new_df

     lev3      lev4      values
lev1    1    2    1    2      1    2
lev2
1     1.5  1.5  1.5  4.5    0.5  3.5
2     1.0  2.0  3.0  6.0    2.0  5.0

In [274]:
new_df=pd.pivot_table(df, 
                     index="lev2",
                      columns="lev1",
                      values='lev3') # take the average of lev3
new_df

lev1    1    2
lev2
1     1.5  1.5
2     1.0  2.0

### Margins

In [277]:
new_df=pd.pivot_table(df, 
                     index="lev2",
                      columns="lev1",
#                       values='lev3',
                      margins=True,
                      aggfunc=np.sum
                     ) # take the numpy functions
new_df

     lev3        lev4         values
lev1    1  2 All    1   2 All      1   2 All
lev2
1       3  3   6    3   9  12      1   7   8
2       1  2   3    3   6   9      2   5   7
All     4  5   9    6  15  21      3  12  15

### group by
as in SQL

In [297]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                            'two'],
                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'baz': [1, 2, 3, 4, 5, 6],
                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [298]:
new_df=pd.pivot_table(df, 
                     index="foo",
                      columns="bar",
                      values='baz',
                      aggfunc=np.max
                     ) # take the numpy functions
new_df

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [306]:
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [317]:
df.groupby(df['foo']).agg(np.mean)

     baz
foo
one    2
two    5